<?php

/* 
 * Статусы и рашифровки ошибок
 */

return [
    // Собственник - Арендатор
    '1000-01' => '#1000-01 Ошибка выполнения Ajax-запроса передачи данных | Block of Profile',
    '1000-02' => '#1000-01 Ошибка выполнения Ajax-запроса. Ошибка при объединении Арендатора с лицевым счетом | Block of Profile',
    '1000-03' => '#1000-03 Ошибка выполнения Ajax-запроса. Ошибка при удалении арендатора | Block of Profile',
    '1000-04' => '#1000-03 Ошибка выполнения Ajax-запроса. Ошибка отвязать арендатора от лицевого счета Собственника | Block of Profile',
    '1000-05' => '#1000-05 Ошибка выполнения Ajax-запроса. Ошибка при обновлении профиля пользователя | Block of Profile',
    '1000-11' => '#1000-05 Ошибка выполнения Ajax-запроса. Ошибка при обновлении информации об Арендаторе через dropDownList | Block of Profile',
    
    '1000-06-1(2)' => '#1000-06-1(2) Ошибка выполнения Ajax-запроса. Ошибка при добавлении учетной записи Арендатора Собственником | Block of Profile',
    '1000-07' => '#1000-07 Ошибка выполнения Ajax-запроса. Ошибка при смене лицевого счета из выпадающего списка (_list-account-all) | Block of Personal Account',
    
    '1000-08' => '#1000-08 Ошибка выполнения Ajax-запроса. Ошибка при сортировке по типу, лицевому счету, статусу заявко | Block of Request',
    '1000-09' => '#1000-09 Ошибка выполнения Ajax-запроса. Ошибка при выставлении оценки заявке | Block of Request',
    
    '1000-10' => '#1000-10 Ошибка выполнения Ajax-запроса. Ошибка при поиске исполнителя | Block of Paid Services',
    
    
    // Администратор
    '2000-01' => '#2000-01: Ошибка выполнения Ajax-запроса. Ошибка при блокировке/разблокировке учетной записи Собственника | Block of All Clients',
    
];